---
kind: property
id: P:Autodesk.Revit.DB.ModelCurveArrArray.IsEmpty
source: html/0ba25366-1f71-42f8-d4fd-73173dada1ff.htm
---
# Autodesk.Revit.DB.ModelCurveArrArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.